// Misc Strings

"fibre-channel-card-name"           = "Apple FC Card";
"unknown"                           = "<unknown>";
"default-filename"                  = "Fibre Channel Cards";
"port-name-prefix"                  = "Port ";
"restart-required"                  = "Restart required for settings to take effect.";

// Status string.

"Offline"                           = "The port link is down.";
"Online"                            = "The port link is up.";
// Speed status string.
"speed-status"                      = " The speed is set to <<replace>>.";	// Note that the "<<replace>>" in this string
                                                                            // is replaced by one of the speed status strings below.
                                                                            // This is to allow for different placements within the
                                                                            // sentance of the status string.
// speed status string.
"1-gigabit-per-second"              = "1 Gb/s";
"2-gigabit-per-second"              = "2 Gb/s";
"speed-automatic"                   = "configure automatically";
"automatic-1-gigabit"               = "configure automatically and is currently 1 Gb/s";
"automatic-2-gigabit"               = "configure automatically and is currently 2 Gb/s";

// Topology status string.
"toplogy-status"                    = " The port topology is set to <<replace>>.";	// Note that the "<<replace>>" in this string
                                                                                    // is replaced by one of the speed status strings below.
                                                                                    // This is to allow for different placements within the
                                                                                    // sentance of the status string.
// topology status string.
"point-to-point"                    = "Point-to-Point";
"arbitrated-loop"                   = "Arbitrated Loop";
"topology-automatic"                = "configure automatically";
"automatic-point-to-point"          = "configure automatically and is currently Point-to-Point";
"automatic-arbitrated-loop"         = "configure automatically and is currently Arbitrated Loop";

// Alerts
"incompatible-driver-title"         = "Please install latest driver";
"incompatible-driver"               = "This application requires version 1.1.0 or later of AppleLSIFusionMPT.kext.  Please make sure you have installed the newest driver and try again.";
"alert-no-cards-title"              = "No Apple Fibre Channel card found";
"alert-no-cards"                    = "Make sure the Apple Fibre Channel card is properly installed and try again.";
"alert-restart-title"               = "Restart system?";
"alert-restart-required"            = "A restart is required for new settings to take effect.  Would you like to restart now?";
"alert-ok-button"                   = "OK";
"alert-yes-button"                  = "Yes";
"alert-no-button"                   = "No";
"alert-cancel-button"               = "Cancel";
"alert-tool-title"                  = "fibreconfig Tool Error";
"alert-fibreconfig-error"           = "There was an error with the fibreconfog tool.";
"alert-missing-tool"                = "The fibreconfig tool is missing.";
"alert-non-executeable-tool"        = "The fibreconfig tool is not executable and may need to be reinstalled.";
"ww-node-name-tooltip"              = "World Wide Node Name";
"ww-port-name-tooltip"              = "World Wide Port Name";